import keyboard
import pyttsx3
import win32api
win32api.LoadKeyboardLayout("00000409",1)
#=======================================================================================================
engine = pyttsx3.init() # Створення обєкта
dictor='Natalia'
"""Швидкість"""
rate = engine.getProperty('rate')   # отримання деталей поточної швидкості мовлення 
print (rate)                        # друк поточної швидкості голосу 
engine.setProperty('rate', 200)     # налаштування нової швидкості голосу
"""Гучність"""
volume = engine.getProperty('volume')   # дізнатися про поточний рівень гучності (min=0 і max=1)
print (volume)                          # друк поточного рівеня гучності 
engine.setProperty('volume', 0)    # налаштування рівня гучності між 0 і 1 
"""Вибір голосу"""
voices = engine.getProperty('voices')       # отримання списку доступних дикторів
for voice in voices:                        # пошук голоса диктора в списку
    if voice.name==dictor:
        engine.setProperty('voice', voice.id)  # встановлення голосу диктора 
#=======================================================================================================

n=['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 
'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', 
'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'", 
'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/', '*', '-', '+',
'esc', 'f1', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9', 'f10', 'f11', 'f12', 'home', 'end', 'insert', 'pagedown', 'pageup',
'tab', 'capslock', 'shift', 'space', 'ctrl', 'alt', 'win', 'up', 'right', 'left', 'down', 'backspace', 'delete', 'enter' ]

n1=["'", '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 
'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ї', 
'ф', 'і', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'є', 
'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.', '*', '-', '+',
'ескейп', 'f1', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9', 'f10', 'f11', 'f12', 'Додому', 'кінець', 'insert', 'вниз сторінки', 'вгору сторінки',
'таб', 'капслок', 'шифтt', 'пробіл', 'контрал', 'альт', 'він', 'вгору', 'вправо', 'вліво', 'вниз', 'стерти', 'Видалити', 'ентер' ]


def b1(srt):
    engine.say(srt)
    engine.runAndWait()
    

def run():
    m=0
    for k in n:
        if keyboard.is_pressed(n[m])==True:
            b1(n1[m])
        m+=1

    
while True:
    run()








    



